#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Fri Sep 21 19:35:23 2018

@author: dasha
"""
NAMESa = {
#    'a': 'Переменная А',
#    'b': 'Переменная B',
#    'c': 'Переменная C',
#    'd': 'Переменная D',
    '¬': 'Отрицание (НЕ)',
    '|': 'Штрих Шеффера (И-НЕ)',
    '↓': 'Стрелка Пирса (ИЛИ-НЕ)',
    '&': 'Конъюнкция (И)',
    'v': 'Дизъюнкция (ИЛИ)',
    '⊕': 'Исключающее ИЛИ, сумма по модулю 2 (XOR)',
    '→': 'Импликация (ЕСЛИ-ТО)',
    '←': 'Обратная импликация',
    '≡': 'Эквивалентность (РАВНО)',
#    ')': 'Закрыть скобку',
#    '(': 'Открыть скобку',
}

NAMESb = {
    'a': 'Переменная А',
    'b': 'Переменная B',
    'c': 'Переменная C',
    'd': 'Переменная D',
}

NAMESc = {
    ')': 'Закрыть скобку',
    '(': 'Открыть скобку',
}
